routes/web.php



// display the company details page if the path is good
Route::get('companies/{company}', function ($id) {
    // Use the "find" function inside a class called "Company"
    // To find the company details
    // Pass those details to the "content" property
    // In the view called "company"

    $companyDetails = Company::findOrFail($id);


    return view('company', [
        'company' => $companyDetails
    ]);
});
---
SELECT * FROM `companies` WHERE `companies`.`id` in (1, 2, 3, 4)
SELECT * FROM `companies` WHERE `companies`.`id` in (1)