routes/web.php

    //     logger($query->sql, $query->bindings);
    // });

    return view('employees', [
        'employees' => Employee::latest()->get()
    ]);
---
SELECT * FROM `employees` ORDER BY `created_at` DESC

    ]);
});

Route::get('companies/{company:slug}', function (Company $company) {
    return view('employees', [
        'employees' => $company->employees
    ]);
});
---
SELECT * FROM `employees` WHERE `employees`.`company_id` = 1 and `employees`.`company_id` IS not NULL